uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатурыЗакупок/НастройкаЗаменыНоменклатурыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатурыЗакупок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыЗаменыНоменклатуры/СпособыЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаменыНоменклатуры</name>
  <enumValues>
    <name>ПересчетЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>Унификат</name>
  </enumValues>
  <enumValues>
    <name>Аналоги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/ЦентрализованныеЗакупкиФормыУХ/Module.bsl
#Область РаботаСРеквизитамиФормы

// Устанавливает для указанного элемента формы параметр выбора 
// в соотвествии с указанным значением.
Процедура УстановитьПараметрВыбора(Элемент, 
								   ИмяПараметраВыбора,
								   ЗначениеПериодичности) Экспорт
	НовыйПараметр = Новый ПараметрВыбора(
		ИмяПараметраВыбора, 
		ЗначениеПериодичности);
	МассивПараметров = Новый Массив(Элемент.ПараметрыВыбора);
	УдалитьПараметрВыбора(МассивПараметров, ИмяПараметраВыбора);
	МассивПараметров.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = 
		Новый ФиксированныйМассив(МассивПараметров);
КонецПроцедуры

// Ищет в массиве параметров выбора параметр с требуемым именем.
// Возвращает его индекс.
// Если не находит, то возвращает -1.
//
Функция НайтиИндексПараметраВыбора(МассивПараметров, ИмяПараметра) Экспорт
	ПоследнийИндекс = МассивПараметров.Количество()-1;
	Для Ном = 0 По ПоследнийИндекс Цикл
		Если МассивПараметров[Ном].Имя = ИмяПараметра Тогда
			Возврат Ном
		КонецЕсли;
	КонецЦикла;
	Возврат -1;
КонецФункции

// Удаляет в массиве параметров выбора параметр с требуемым именем.
//
Процедура УдалитьПараметрВыбора(МассивПараметров, ИмяПараметра) Экспорт
	Индекс = НайтиИндексПараметраВыбора(МассивПараметров, ИмяПараметра);
	Если Индекс >= 0 Тогда
		МассивПараметров.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры

Функция ПараметрыРеквизитов() Экспорт

	ИзменениеРеквизитов = Новый Структура;
	ИзменениеРеквизитов.Вставить("ДобавляемыеРеквизиты", 	Новый Массив);  
	ИзменениеРеквизитов.Вставить("УдаляемыеРеквизиты", 		Новый Массив);  
	ИзменениеРеквизитов.Вставить("СуществующиеРеквизиты",	Новый Соответствие);
   	
	Возврат ИзменениеРеквизитов;

КонецФункции 

Процедура ДобавитьРеквизитыЗаменыНаУнификаты(ИзменениеРеквизитов, Путь) Экспорт  
	
	УнификатыНастройкиФормы = Новый РеквизитФормы("УнификатыНастройкиФормы", Новый ОписаниеТипов());  
	Найдено = Ложь;
	Для Каждого РеквизитФормы Из ИзменениеРеквизитов.ДобавляемыеРеквизиты Цикл  
		Если РеквизитФормы.Имя = УнификатыНастройкиФормы.Имя Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не Найдено Тогда
		ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(УнификатыНастройкиФормы);
	КонецЕсли;
	
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыНеЗаменятьНаУнификат",	
														Новый ОписаниеТипов("Булево"), Путь, "Не заменять на унификат", Ложь));	
														
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыЗамененоНаУнификат",	
														Новый ОписаниеТипов("Булево"), Путь, "Заменено на унификат", Ложь));  
														
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыЕстьУнификат",			
														Новый ОписаниеТипов("Булево"), Путь, "Есть унификат", Ложь));    
														
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыНоменклатураИсходная",	
														Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипНоменклатураЕХ.Тип), Путь, "Номенклатура (исх)", Ложь)); 
														
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыХарактеристикаИсходная",
														Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"))), Путь, "Хатактеристика (исх)", Ложь));
														
	ИзменениеРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УнификатыЕдиницаИзмеренияИсходная",
														Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЕдиницаИзмерения.Тип), Путь, "Ед.изм (исх)", Ложь));

КонецПроцедуры  

Процедура ДобавитьУдалитьРеквизитыФормы(Форма, ИзменениеРеквизитов, ПроверятьРеквизиты = Ложь) Экспорт  

	Если ПроверятьРеквизиты = Истина Тогда
		Реквизиты = Форма.ПолучитьРеквизиты();    
		СуществующиеРеквизиты = Новый Соответствие;
		Для Каждого Реквизит Из Реквизиты Цикл     
			СуществующиеРеквизиты.Вставить("." + Реквизит.Имя, Реквизит);
		КонецЦикла; 
		Для Каждого ДобавляемыйРеквизит Из ИзменениеРеквизитов.ДобавляемыеРеквизиты Цикл 
			Если Не ПустаяСтрока(ДобавляемыйРеквизит.Путь) Тогда    
				Реквизиты = Форма.ПолучитьРеквизиты(ДобавляемыйРеквизит.Путь);   
				Для Каждого Реквизит Из Реквизиты Цикл     
					СуществующиеРеквизиты.Вставить(ДобавляемыйРеквизит.Путь + "." + Реквизит.Имя, Реквизит);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		УдалитьРеквизиты = Новый Массив;
		Для Каждого ДобавляемыйРеквизит Из ИзменениеРеквизитов.ДобавляемыеРеквизиты Цикл  
			Если СуществующиеРеквизиты.Получить(ДобавляемыйРеквизит.Путь + "." + ДобавляемыйРеквизит.Имя) <> Неопределено 
			Или ИзменениеРеквизитов.СуществующиеРеквизиты.Получить(ДобавляемыйРеквизит.Имя) <> Неопределено Тогда
            	УдалитьРеквизиты.Добавить(ДобавляемыйРеквизит);
			КонецЕсли;
		КонецЦикла;  
		Для Каждого Реквизит Из УдалитьРеквизиты Цикл 
			ИзменениеРеквизитов.СуществующиеРеквизиты.Вставить(Реквизит.Имя, Истина);
			ИзменениеРеквизитов.ДобавляемыеРеквизиты.Удалить(ИзменениеРеквизитов.ДобавляемыеРеквизиты.Найти(Реквизит));
		КонецЦикла;
	КонецЕсли;

	Форма.ИзменитьРеквизиты(ИзменениеРеквизитов.ДобавляемыеРеквизиты, ИзменениеРеквизитов.УдаляемыеРеквизиты); 
	
	Для Каждого Реквизит Из ИзменениеРеквизитов.ДобавляемыеРеквизиты Цикл 
		ИзменениеРеквизитов.СуществующиеРеквизиты.Вставить(Реквизит.Имя, Истина);
	КонецЦикла; 
	Для Каждого Реквизит Из ИзменениеРеквизитов.УдаляемыеРеквизиты Цикл  
		Если ИзменениеРеквизитов.СуществующиеРеквизиты.Получить(Реквизит.Имя) <> Неопределено Тогда
			ИзменениеРеквизитов.СуществующиеРеквизиты.Удалить(Реквизит.Имя, Истина);  
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


Процедура ДобавитьЭлементыЗамены(Форма, Родитель, ВставитьПередЭлементом) Экспорт  
	
	Путь = Форма.УнификатыНастройкиФормы[Родитель.Имя].ПутьТЧ; 
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти(Родитель.Имя + "_УнификатыГруппаНеЗаменять") = Неопределено Тогда
		УнификатыГруппаНеЗаменять = ФормыУХ.СоздатьГруппуФормы(Элементы, 
												Родитель.Имя + "_УнификатыГруппаНеЗаменять", 
												Нстр("ru = 'Не зменять (группа)'"), 
												ВидГруппыФормы.ГруппаКолонок, 
												Родитель, 
												ВставитьПередЭлементом, 
												Новый Структура("Группировка, ФиксацияВТаблице", ГруппировкаКолонок.ВЯчейке, ВставитьПередЭлементом.ФиксацияВТаблице)); 
	КонецЕсли;	
	Если Элементы.Найти(Родитель.Имя + "_УнификатыНеЗаменятьНаУнификат") = Неопределено Тогда	
		УнификатыНеЗаменятьНаУнификат = ФормыУХ.СоздатьПолеФормы(Элементы, 
												Родитель.Имя + "_УнификатыНеЗаменятьНаУнификат", 
												Нстр("ru = 'Не заменять'"),
												Путь + ".УнификатыНеЗаменятьНаУнификат", 
												ВидПоляФормы.ПолеФлажка, 
												УнификатыГруппаНеЗаменять,,
												Новый Структура("КартинкаШапки, ПоложениеЗаголовка", БиблиотекаКартинок.СинхронизацияДанныхКоллизия, ПоложениеЗаголовкаЭлементаФормы.Нет),
												Новый Структура("ПриИзменении", "Подключаемый_НеЗаменятьНаУнификатПриИзменении"));     
	КонецЕсли;										
	Если Элементы.Найти(Родитель.Имя + "_УнификатыНеЗамененоНаУнификат") = Неопределено Тогда
		УнификатыНеЗамененоНаУнификат = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, 
												Родитель.Имя + "_УнификатыНеЗамененоНаУнификат", 
												Нстр("ru = 'Заменено'"),
												Путь + ".УнификатыЗамененоНаУнификат", 
												ВидПоляФормы.ПолеКартинки, 
												УнификатыГруппаНеЗаменять,,
												Новый Структура("КартинкаЗначений, ПоложениеЗаголовка, ТолькоПросмотр, АвтоМаксимальнаяШирина, Ширина", 
																	БиблиотекаКартинок.СинхронизацияДанныхКоллизия, ПоложениеЗаголовкаЭлементаФормы.Нет, Истина, Ложь, 1),
												Новый Структура("ПриИзменении", "Подключаемый_НеЗаменятьНаУнификатПриИзменении"));
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеУнификатов(Форма, ЭлементИмя) Экспорт  
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "УнификатыНастройкиФормы") Тогда
		
		Настройки = Форма.УнификатыНастройкиФормы[ЭлементИмя];   
		
		ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить(); 
		ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Настройки.ПутьТЧ + ".УнификатыЕстьУнификат");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;      
		ФормыУХ.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ЭлементИмя + "_УнификатыНеЗаменятьНаУнификат");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);         
		
	КонецЕсли;

КонецПроцедуры       

Процедура УстановитьСвойстваУнификат(Форма, ЭлементИмя, Потребность) Экспорт  
	
	Настройки = Форма.УнификатыНастройкиФормы[ЭлементИмя];

	Унификат = ПолучитьУнификатДляНоменклатуры(Потребность[Настройки.ПолеНоменклатура], Потребность[Настройки.ПолеХарактеристика]);
	Если Унификат = неопределено Тогда
		Потребность.УнификатыЕстьУнификат = Ложь;   
		Потребность.УнификатыЗамененоНаУнификат = Ложь;
		Потребность.УнификатыНоменклатураИсходная		= Неопределено;
		Потребность.УнификатыХарактеристикаИсходная		= Неопределено;
		Потребность.УнификатыЕдиницаИзмеренияИсходная	= Неопределено;
	Иначе
		Потребность.УнификатыЕстьУнификат				= Истина;
		Потребность.УнификатыНоменклатураИсходная		= Потребность[Настройки.ПолеНоменклатура];
		Потребность.УнификатыХарактеристикаИсходная		= Потребность[Настройки.ПолеХарактеристика];
		Потребность.УнификатыЕдиницаИзмеренияИсходная	= Потребность[Настройки.ПолеЕдиницаИзмерения]; 
		Потребность[Настройки.ПолеНоменклатура]			= Унификат.Номенклатура;
		Потребность[Настройки.ПолеХарактеристика]		= Унификат.Характеристика;
		Потребность[Настройки.ПолеЕдиницаИзмерения]		= Унификат.ЕдиницаИзмерения;
		Потребность.УнификатыЗамененоНаУнификат			= Истина;   
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьНастройкиУнификатовФормы(Форма, ИмяЭлемента, ПутьТЧ, ПолеНоменклатура, ПолеХарактеристика, ПолеЕдиницаИзмерения, ОбработчикНоменклатуры) Экспорт  
	
	Если Форма.УнификатыНастройкиФормы = Неопределено Тогда  
		НастройкиПоИмени = Новый Структура;
	Иначе
		НастройкиПоИмени = Новый Структура(Форма.УнификатыНастройкиФормы);
	КонецЕсли;
	
	НастройкиФормы = Новый Структура("ПутьТЧ, ПолеНоменклатура, ПолеХарактеристика, ПолеЕдиницаИзмерения, ОбработчикНоменклатуры"); 
	НастройкиФормы.ПутьТЧ 				= ПутьТЧ;
	НастройкиФормы.ПолеНоменклатура 	= ПолеНоменклатура;
	НастройкиФормы.ПолеХарактеристика	= ПолеХарактеристика;
	НастройкиФормы.ПолеЕдиницаИзмерения = ПолеЕдиницаИзмерения;
	НастройкиФормы.ОбработчикНоменклатуры= ОбработчикНоменклатуры;  
	
	НастройкиПоИмени.Вставить(ИмяЭлемента, Новый ФиксированнаяСтруктура(НастройкиФормы));
	Форма.УнификатыНастройкиФормы = Новый ФиксированнаяСтруктура(НастройкиПоИмени);	

КонецПроцедуры   

// Функция - Возвращает унификат для номенклатуры+характеристики. Если не найден, то возвращает неопределено
//
// Параметры:
//  Номенклатура	 - СправочникСсылка.Номенклатура	 - 
//  Характеристика	 - СправочникСсылка.ХарактуристикаНоменклатуры	 - 
// 
// Возвращаемое значение:
//  неопределено, Структура - если нет унификата, то вовращается неопределено. Иначе возвращается структура со следующими полями:
//		* Номенклатура
//		* Характеристика
//		* ЕдиницаИзмерения
//
Функция ПолучитьУнификатДляНоменклатуры(Номенклатура, Характеристика) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкаЗаменыНоменклатуры.НоменклатураПриемник КАК Номенклатура,
	|	НастройкаЗаменыНоменклатуры.ХарактеристикаПриемник КАК Характеристика,
	|	НастройкаЗаменыНоменклатуры.ЕдиницаИзмеренияПриемник КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.НастройкаЗаменыНоменклатурыЗакупок.СрезПоследних КАК НастройкаЗаменыНоменклатуры
	|ГДЕ
	|	НастройкаЗаменыНоменклатуры.НоменклатураИсточник = &НоменклатураИсточник
	|	И НастройкаЗаменыНоменклатуры.ХарактеристикаИсточник = &ХарактеристикаИсточник
	|	И НастройкаЗаменыНоменклатуры.СпособЗамены = ЗНАЧЕНИЕ(Перечисление.СпособыЗаменыНоменклатуры.Унификат)";
	
	Запрос.УстановитьПараметр("НоменклатураИсточник", 	Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаИсточник", Характеристика);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат неопределено;
	КонецЕсли;

	РезультатУнификат = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения");
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РезультатУнификат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат РезультатУнификат;
	
КонецФункции



#КонецОбласти

       

#Область НеЭкспортныеФункции


Функция УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяРеквизита, Значение)
	Элемент = ЭлементыФормы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Элемент[ИмяРеквизита] = Значение;
КонецФункции

Процедура ОбработкаЗаполненияПоступлениеТоваровУслуг(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
